@echo off
title 快速构建安卓签名Key ZERYZHANG
echo ======================================================================
echo ======================================================================
echo 使用管理员方式运行，构建成功文件保存在当前目录。
echo 注意：运行前请保证keytool能够正常运行（进行环境变量配置）
echo 可直接拷贝此文件到keytool目录中
echo ======================================================================
echo ======================================================================
echo 【输入你要创建的key的头衔名称 需要记牢】
set /p name=名称：
echo 【输入你要创建的key名称，格式如mykey.keystore】
set /p keyname=名称：



keytool -genkey -alias %name% -keyalg RSA -validity 20000 -keystore %keyname%

pause